docs/gof.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-09-23 Mon 11:57 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Goodness of fit of deconvolved distributions</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Abhishek Sarkar">
<link href="css/bootstrap.min.css" rel="stylesheet" />
<link rel="stylesheet" type="text/css" href="css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="css/supp.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Goodness of fit of deconvolved distributions</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org283b08a">Introduction</a></li>
<li><a href="#setup">Setup</a></li>
<li><a href="#org9458460">Methods</a>
<ul>
<li><a href="#org965c40b">Test for goodness of fit</a></li>
<li><a href="#orgfd5c235">Data</a></li>
</ul>
</li>
<li><a href="#org2a494f2">Results</a>
<ul>
<li><a href="#org3576756">Goodness of fit test</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org283b08a" class="outline-2">
<h2 id="org283b08a">Introduction</h2>
<div class="outline-text-2" id="text-org283b08a">
<p>
We <a href="deconvolution.html">previously estimated</a> the out-of-sample log likelihood as a measure of the
generalization performance of distribution deconvolution methods for
scRNA-seq. However, this is not the simplest way to support some of our key
results:
</p>

<ol class="org-ol">
<li>For most genes, in most data sets, a Gamma assumption appears sufficient
(meaning, more complicated distributional assumptions do not have better
generalization performance).</li>
<li>When Gamma is insufficient, it is generally not the case that assuming a
point mass on zero improves generalization (meaning, departures from Gamma
do not involve excess zeros).</li>
</ol>

<p>
Here, we directly test for the goodness of fit of the estimated distribution
(as in <a href="https://dx.doi.org/10.1371/journal.pgen.1008045">Sarkar et al. 2019</a>).
</p>
</div>
</div>

<div id="outline-container-org4b66c4c" class="outline-2">
<h2 id="setup"><a id="org4b66c4c"></a>Setup</h2>
<div class="outline-text-2" id="text-setup">
<div class="org-src-container">
<pre class="src src-ipython">%matplotlib inline
%config <span class="org-variable-name">InlineBackend.figure_formats</span> = <span class="org-builtin">set</span>([<span class="org-string">'retina'</span>])
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython" id="orgde1bf22"><span class="org-keyword">import</span> numpy <span class="org-keyword">as</span> np
<span class="org-keyword">import</span> pandas <span class="org-keyword">as</span> pd
<span class="org-keyword">import</span> scmodes
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-keyword">import</span> matplotlib.pyplot <span class="org-keyword">as</span> plt
<span class="org-variable-name">plt.rcParams</span>[<span class="org-string">'figure.facecolor'</span>] = <span class="org-string">'w'</span>
<span class="org-variable-name">plt.rcParams</span>[<span class="org-string">'font.family'</span>] = <span class="org-string">'Nimbus Sans'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9458460" class="outline-2">
<h2 id="org9458460">Methods</h2>
<div class="outline-text-2" id="text-org9458460">
</div>
<div id="outline-container-org965c40b" class="outline-3">
<h3 id="org965c40b">Test for goodness of fit</h3>
<div class="outline-text-3" id="text-org965c40b">
<p>
The key idea underlying our test for goodness of fit is the fact that if
\(x_{i} \sim F(\cdot)\), then \(F(x_{i}) \sim \operatorname{Uniform}(0,
  1)\). To test for goodness of fit of an estimated \(\hat{F}\) to the data
\(x_{1}, \ldots, x_{n}\), we apply the Kolmogorov-Smirnov (KS) test to test
whether the values \(\hat{F}(x_1), \ldots, \hat{F}(x_n)\) are uniformly
distributed. (This test is slightly conservative because it uses the same
data to estimate \(\hat{F}\).)
</p>

<p>
Here, we have to modify this simple procedure to account for the fact that
our data are discrete counts, so \(F\) is not continuous. To address this
issue, we used randomized quantiles (<a href="https://www.jstor.org/stable/1390802">Dunn 1996</a>): we sample one random value
per observation \(u_{i} \mid x_{i} \sim \mathrm{Uniform}(\hat{F}(x_i - 1),
  \hat{F}(x_i))\). These have the property that if \(x_i \sim F\) then \(u_i
  \sim \mathrm{Uniform}(0, 1)\).
</p>

<p>
In our model, each observed UMI count \(x_{i}\) comes from a different
distribution \(F_{i}\):
</p>

<p>
\[ F_i(x_i) = \sum_{k=0}^{x_i} \int_0^\infty \operatorname{Poisson}(k; s_i
  \lambda_i) g(d\lambda_i) \]
</p>

<p>
We therefore draw \(u_{i} \mid x_{i} \sim
  \mathrm{Uniform}(\hat{F}_{i}(x_{i} - 1), \hat{F}_{i}(x_{i}))\). Then, we
apply the KS test to whether the randomized quantiles \(u_{i}\) are uniformly
distributed.
</p>
</div>
</div>

<div id="outline-container-orgfd5c235" class="outline-3">
<h3 id="orgfd5c235">Data</h3>
<div class="outline-text-3" id="text-orgfd5c235">
<div class="org-src-container">
<pre class="src src-ipython" id="org5c09812"><span class="org-keyword">def</span> <span class="org-function-name">_cd8_cd19_mix</span>():
  <span class="org-variable-name">t_cells</span> = scmodes.dataset.read_10x(<span class="org-string">'/project2/mstephens/aksarkar/projects/singlecell-ideas/data/10xgenomics/cytotoxic_t/filtered_matrices_mex/hg19/'</span>, return_df=<span class="org-constant">True</span>, min_detect=0)
  <span class="org-variable-name">b_cells</span> = scmodes.dataset.read_10x(<span class="org-string">'/project2/mstephens/aksarkar/projects/singlecell-ideas/data/10xgenomics/b_cells/filtered_matrices_mex/hg19/'</span>, return_df=<span class="org-constant">True</span>, min_detect=0)
  <span class="org-keyword">return</span> scmodes.dataset.synthetic_mix(t_cells, b_cells, min_detect=0.25)[0]

<span class="org-keyword">def</span> <span class="org-function-name">_cyto_naive_mix</span>():
  <span class="org-variable-name">cyto</span> = scmodes.dataset.read_10x(prefix=<span class="org-string">'/project2/mstephens/aksarkar/projects/singlecell-ideas/data/10xgenomics/cytotoxic_t/filtered_matrices_mex/hg19'</span>, return_df=<span class="org-constant">True</span>, min_detect=0)
  <span class="org-variable-name">naive</span> = scmodes.dataset.read_10x(prefix=<span class="org-string">'/project2/mstephens/aksarkar/projects/singlecell-ideas/data/10xgenomics/naive_t/filtered_matrices_mex/hg19'</span>, return_df=<span class="org-constant">True</span>, min_detect=0)
  <span class="org-variable-name">x</span>, <span class="org-variable-name">y</span> = scmodes.dataset.synthetic_mix(cyto, naive)
  <span class="org-variable-name">keep_genes</span> = (x &gt; 0).mean(axis=0) &gt;= 0.25
  <span class="org-variable-name">x</span> = x.loc[:,keep_genes]

<span class="org-variable-name">data</span> = {
  <span class="org-string">'cytotoxic_t'</span>: <span class="org-keyword">lambda</span>: scmodes.dataset.read_10x(<span class="org-string">'/project2/mstephens/aksarkar/projects/singlecell-ideas/data/10xgenomics/cytotoxic_t/filtered_matrices_mex/hg19/'</span>, return_df=<span class="org-constant">True</span>),
  <span class="org-string">'b_cells'</span>: <span class="org-keyword">lambda</span>: scmodes.dataset.read_10x(<span class="org-string">'/project2/mstephens/aksarkar/projects/singlecell-ideas/data/10xgenomics/b_cells/filtered_matrices_mex/hg19/'</span>, return_df=<span class="org-constant">True</span>),
  <span class="org-string">'ipsc'</span>: <span class="org-keyword">lambda</span>: scmodes.dataset.ipsc(<span class="org-string">'/project2/mstephens/aksarkar/projects/singlecell-qtl/data/'</span>, n=100, return_df=<span class="org-constant">True</span>),
  <span class="org-string">'cytotoxic_t-b_cells'</span>: _cd8_cd19_mix,
  <span class="org-string">'cytotoxic_t-naive_t'</span>: _cyto_naive_mix,
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2a494f2" class="outline-2">
<h2 id="org2a494f2">Results</h2>
<div class="outline-text-2" id="text-org2a494f2">
</div>
<div id="outline-container-org3576756" class="outline-3">
<h3 id="org3576756">Goodness of fit test</h3>
<div class="outline-text-3" id="text-org3576756">
<p>
Run the GPU-based methods.
</p>

<div class="org-src-container">
<pre class="src src-sh">sbatch --partition=gpu2 --gres=gpu:1 --mem=16G --time=12:00:00 -a 0
<span class="org-comment-delimiter">#</span><span class="org-comment">!/bin/bash</span>
<span class="org-builtin">source</span> activate scmodes
python &lt;&lt;EOF
<span class="org-sh-heredoc">&lt;&lt;imports&gt;&gt;</span>
import os
&lt;&lt;data&gt;&gt;
<span class="org-sh-heredoc">tasks = list(data.keys())</span>
<span class="org-sh-heredoc">task = tasks[int(os.environ['SLURM_ARRAY_TASK_ID'])]</span>
<span class="org-sh-heredoc">x = data[task]()</span>
<span class="org-sh-heredoc">res = scmodes.benchmark.evaluate_gof(x, methods=['gamma', 'zig'])</span>
<span class="org-sh-heredoc">res.to_csv(f'/scratch/midway2/aksarkar/modes/deconv-generalization/{task}-gpu.txt.gz', compression='gzip', sep='\t')</span>
<span class="org-sh-heredoc">EOF</span>
</pre>
</div>

<p>
Run the CPU methods
</p>

<div class="org-src-container">
<pre class="src src-sh">sbatch --partition=broadwl -n1 -c28 --exclusive --time=12:00:00 -a 0
<span class="org-comment-delimiter">#</span><span class="org-comment">!/bin/bash</span>
<span class="org-builtin">source</span> activate scmodes
python &lt;&lt;EOF
<span class="org-sh-heredoc">&lt;&lt;imports&gt;&gt;</span>
import os
&lt;&lt;data&gt;&gt;
<span class="org-sh-heredoc">methods = ['unimodal']</span>
<span class="org-sh-heredoc">tasks = list(data.keys())</span>
<span class="org-sh-heredoc">task = tasks[int(os.environ['SLURM_ARRAY_TASK_ID'])]</span>
<span class="org-sh-heredoc">with mp.Pool(maxtasksperchild=20) as pool:</span>
<span class="org-sh-heredoc">  # Important: this needs to be done after initializing the pool to avoid</span>
<span class="org-sh-heredoc">  # memory duplication</span>
<span class="org-sh-heredoc">  x = data[task]()</span>
<span class="org-sh-heredoc">  res = scmodes.benchmark.evaluate_gof(x, pool=pool, methods=methods)</span>
<span class="org-sh-heredoc">  res.index = x.columns</span>
<span class="org-sh-heredoc">  res.to_csv(f'/scratch/midway2/aksarkar/modes/gof/{task}-unimodal.txt.gz', compression='gzip', sep='\t')</span>
<span class="org-sh-heredoc">EOF</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Abhishek Sarkar</p>
<p class="date">Created: 2019-09-23 Mon 11:57</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
